// Напишите программу, которая принимает на 
// вход пятизначное число и проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да

 // Не справился __________________________________________________

//  Напишите программу, которая принимает 
//  на вход координаты двух точек и находит 
//  расстояние между ними в 3D пространстве.

// A (3,6,8); B (2,1,-7), -> 15.84

// A (7,-5, 0); B (1,-1,9) -> 11.53

// Console.WriteLine("Введите координаты X1 :");
// int x1 = int.Parse(Console.ReadLine());
// Console.WriteLine("Введите координаты y1 :");
// int y1 = int.Parse(Console.ReadLine());
// Console.WriteLine("Введите координаты z1 :");
// int z1 = int.Parse(Console.ReadLine());
// Console.WriteLine("Введите координаты X2 :");
// int x2 = int.Parse(Console.ReadLine());
// Console.WriteLine("Введите координаты y2 :");
// int y2 = int.Parse(Console.ReadLine());
// Console.WriteLine("Введите координаты z2 :");
// int z2 = int.Parse(Console.ReadLine());
// // AB = √(xb - xa)2 + (yb - ya)2  ///
// int a = (x2-x1)*(x2-x1);
// int b = (y2-y1)*(y2-y1);
// int c = (z2-z1)*(z2-z1);
// double d = Math.Sqrt(a+b+c);
// Console.WriteLine (d);



//__________________________________________________________________________________________________

// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

// 3 -> 1, 8, 27
// 5 -> 1, 8, 27, 64, 125

// Console.WriteLine("Введите число");
// int N =int.Parse(Console.ReadLine());
// int x = 1;
// while(x <= N)
// {
//     int y=x*x*x;
//     Console.WriteLine(y);
//     x++;
// }